Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You can re-dock it again at any time by dragging it to the sides or bottom of the IDE.
zh_cn: 您可以随时通过将其拖动到 IDE 的两侧或底部来重新使其停靠。

source: You can refresh the list by clicking the Refresh Button
zh_cn: 你可以通过点击刷新（Refresh）按钮来刷新设备列表。

source: You can see a brief overview of each of the available resources from the resource tree by clicking any of the buttons below:
zh_cn: 您可以通过单击以下任一按钮，从资源树中查看每种可用资源的简要概述：

source: You can see the memory use, or how the GML is performing on the CPU, or a combination of both.
zh_cn: 你可以查看内存使用，或者GML在CPU中是如何表现的，或者二者结合。

source: You can select "OK" here to remove this message and silently fail to edit the images together until only a single layer is selected.
zh_cn: 你可以在此处选择“是”来去掉这个消息并无法一起编辑多个图像，此时只有在选择单个图层的时候才可以正常编辑。

source: You can select any buffer created by setting the Buffer ID value, which will start at 0 for the first buffer created in your game, and increment by 1 for each consecutive buffer.
zh_cn: 你可以选择任一使用缓冲ID的值产生的缓冲器，其中缓冲ID对第一个缓冲器是从0开始的，接下来的缓冲器每一个的ID加1。

source: You can select from textures or surfaces from the top of the watch, and then select the texture or surface ID to have it displayed in the window.
zh_cn: 你可以在视图顶端选择材质还是表面，然后选择材质或表面的ID让它显示在窗口中。

source: You can set here whether to show this message, or have the IDE simply choose the "Yes" or "No" option.
zh_cn: 你可以在此处设置是否显示这个消息，还是让IDE直接选择“是”（Yes）或“否”（No）的选项。

source: You can set the speed to follow the path and a number of other actions relating to the position and orientation of the path within the room too.
zh_cn: 你可以设置物体跟随路径的速度以及房间中其他一些关于路径的位置和方向的值。

source: You can setup the IDE however you wish, with certain elements (like the Resource Tree, or the Output Windows) arranged differently to the default.
zh_cn: 你可以通过把某些界面元素（如资源树或输出窗口等）安排成异于默认布局的方式来把IDE配置成任何你想要的布局。

source: You can specify a local x and y position to copy from as well as the width and height of the section.
zh_cn: 你可以指定源表面复制区域的局部x和y坐标，以及选区的宽度和高度。

source: You can still open the object editor by right clicking and selecting Open Properties.
zh_cn: 您仍然可以通过单机右键 并选择 打开属性 来打开精灵编辑器。

source: You can still open the sprite editor by right clicking and selecting Open Properties.
zh_cn: 你仍然可以通过右键点击 并选择 打开属性 打开精灵编辑器。

source: You can suppress this message by selecting "Okay" here, or have it do nothing by selecting "No".
zh_cn: 你可以选择“是”来禁用该信息，或者选择“否”而不做任何事情。

source: You can switch that behaviour off here so that new rooms will have no pre-made layers.
zh_cn: 你可以切换这个行为，让新房间不会产生预制的层。

source: You can then select the one you want to use for the object.
zh_cn: 然后，您可以选择要用于该物体的一个​​。

source: You can then use the right mouse button menu (see below) to add resources and organise them as you wish.
zh_cn: 然后，您可以使用鼠标右键菜单（见下文）来添加资源并根据需要进行组织。

source: You can then use these in the room editor (or procedurally through code) to generate a tile map in your room.
zh_cn: 然后，您可以在房间编辑器（或在程序中通过代码）使用这些图块在房间中生成图块地图。

source: You can update the runtime list at any time from the given RSS feed clicking the refresh button .
zh_cn: 您随时可以点击刷新按钮 从给定RSS源更新运行库列表。

source: You can use the standard keyboard shortcuts too: + X, + C, and + V.
zh_cn: 您也可以使用标准键盘快捷键： + X </ t2>， + C </ t4>和 + V 。

source: You can use this function to enable or disable the application surface at any time in your game, but you should note that it requires at least one frame (step) for the changes to take effect.
zh_cn: 你可以游戏中的任何时间使用这个函数启用或禁用应用表面层，但应该注意更改生效至少需要一帧（一步）。

source: You can use this function to enable or disable the automatic drawing of the application surface.
zh_cn: 你可以使用这个函数决定允许或者不允许应用表面层的自动绘制。

source: You can use this option to change the maximum number of recent actions that will be shown (default 5).
zh_cn: 你可以使用这个选项来改变最近使用的动作的最大显示数量（默认为5）。

source: You can use this to compile smaller game or games where performance is not ever going to be an issue, however.
zh_cn: 当然，您可以使用它来编译较小的游戏，这些游戏在性能方面不会出现问题。

source: You can use this to search through all the scripted resources in your game, including room code, event code and scripts.
zh_cn: 您可以使用它来搜索游戏中的所有脚本资源，包括房间代码，事件代码和脚本。

source: You cannot add existing resources through the right-click menu
zh_cn: 你不可以通过右键菜单添加已有资源

source: You cannot change the YoYo Games Splash Screen
zh_cn: 你不可以更改 YOYO Games 启动界面

source: You cannot create Audio Groups
zh_cn: 你不可以创建音频组（Audio Groups）

source: You cannot create Texture Groups
zh_cn: 你不可以创建纹理组（Texture Groups）

source: You cannot create Texture Pages
zh_cn: 你不可以创建纹理页（Texture Pages）

source: You cannot debug a project while using YYC, running using VM instead.
zh_cn: 使用YYC时无法调试项目，请使用虚拟机（VM）运行。

source: You cannot delete the default view.
zh_cn: 不可删除默认视图

source: You cannot disable anonymous IDE analytics
zh_cn: 你不可以禁用IDE匿名分析

source: You cannot do operations on a pointer and it is used only for some very specific functions, like getting a texture or buffer address from memory for another function.
zh_cn: 你不可以对指针进行操作，它们只是被用于某些极特殊的函数中的，像给其他函数取得纹理或缓冲区地址的函数中。

source: You cannot download assets from the Marketplace
zh_cn: 你不可以从市场（Marketplace）下载资产

source: You cannot import YYZ packages
zh_cn: 你不可以从YYZ工程包进行导入

source: You cannot import old projects from previous versions of GameMaker Studio
zh_cn: 你不可以导入旧版GameMaker Studio的工程

source: You cannot use the built in Source Control
zh_cn: 你不可以使用内置的源码控制（Source Control）

source: You could also have keys that opened nothing by having a MASK of 0.
zh_cn: 你也可以用一个以 0 为掩码的钥匙，它不能打开任何一扇门。

source: You could open another Sound Mixer or close unused groups in this window.
zh_cn: 您可以在此窗口中打开另一个混音器或关闭未使用的组。

source: You do not currently have any assets in your Library.
zh_cn: 当前你的库中没有任何资产。

source: You do not have a Publisher attached to this account.
zh_cn: 你的帐户没有绑定发布者帐号。

source: You give the two arrays to check, and the function will return true if they are equal (either equivalent or the same) or false if they are not.
zh_cn: 你需要两个待检测的数组，并且如果它们相等（可以是等价或者一致），函数将会返回true，否则返回false。

source: You have a new IDE update feed available.
zh_cn: 您有一个新的IDE更新源可用。

source: You have added a statement to a switch outside of either a case: or default: call (for more information on switch see here)
zh_cn: 你向 switch 语句中 case: 或 default: 之外的地方添加了一条语句（有关switch 的更多信息，请参阅 这里）

source: You have an invalid character in your game code, which can happen with foreign language characters or Unicode
zh_cn: 您的游戏代码中有一个无效字符，这可能发生在外语字符或 Unicode 中

source: You have called an unknown function
zh_cn: 你调用了未知函数

source: You have create a wrong global string when using gml_pragma (for more information on gml_pragma see here)
zh_cn: 你在使用 gml_pragma 时创建了一个错误的全局字符串（有关 gml_pragma 的详细信息，请参阅 这里）

source: You have created a do... until loop but neglected to supply an until expression (see here for more info on do... until)
zh_cn: 你创建了一个 do... until 循环，但没有提供 until 表达式(有关 do... until 的更多信息，请参阅 这里）

source: You have created a script comment using /* [comment] */ but have not supplied the closing comment tag (see here for more info)
zh_cn: 你使用 /* [comment] */ 创建了一个脚本注释，但是没有提供结束标记（更多相关信息请参阅 这里）

source: You have created a wrong global string when using gml_pragma (for more information on gml_pragma see here)
zh_cn: 你在使用 gml_pragma 时创建了一个错误的全局字符串（有关 gml_pragma的详细信息，请参阅 这里）

source: You have created a wrong string command for PNGCrush when using gml_pragma (for more information on gml_pragma see here)
zh_cn: 你在使用 gml_pragma 时为 PNGCrush 创建了一个错误的字符串命令（有关 gml_pragma 的更多信息，请参阅 这里）

source: You have created an assignment which expects an operator but none has been supplied (see here for more info on assigning values)
zh_cn: 你创建了一个赋值，它需要一个操作符，但是没有提供操作符（有关赋值的更多信息，请参阅 这里）

source: You have given a number of arguments to a script, but fail to reference one of them in the script, for example, your script takes three arguments but you only use arguments [0] and [2] (for more information on scripts and arguments see here)
zh_cn: 您已经为一个脚本提供了许多参数，但是没有在脚本中引用其中一个参数，例如，您的脚本接受三个参数，但是您只使用参数 [0] 和 [2]（关于脚本和参数的更多信息，请参阅 这里)

source: You have multiple levels of undo too, so you can press this multiple times to "roll back" changes.
zh_cn: 你也可以进行多重撤销，所以你可以多按几次来“回滚”改动。

source: You have no created the enmu correctly (see here for more information on Enums)
zh_cn: 你没有正确地创建枚举（有关枚举的更多信息，请参阅 这里）

source: You have not copied a gadget.
zh_cn: 你还没有复制一个部件。

source: You have not selected a gadget.
zh_cn: 你还没有选择一个部件。

source: You have not specified a commit message, are you sure you want to continue?
zh_cn: 你尚未指定一个提交信息，你确定要继续吗？

source: You have not successfully logged in to the given Cloud Service
zh_cn: 未能成功登陆到给定的云服务。

source: You have not used break within a switch or a loop or any other permitted structure (see here for more information on break)
zh_cn: 你没有在 switch、loop 或任何其他允许的结构中使用 break（有关 break 的更多信息，请参阅 这里）

source: You have not used continue within the correct context (see here for more information on continue)
zh_cn: 你没有在正确的上下文中使用 continue(有关 continue 的更多信息，请参阅 这里）

source: You have not used a required symbol when writing your code (see the section on Expressions or on Language Features for more info)
zh_cn: 你在编写代码时没有使用必需的符号（更多信息请参阅 表达式 或 语言特性 部分）

source: You have reached the end of file unexpectedly while using the File Functions
zh_cn: 在使用 文件函数 时，意外地到达了文件的末尾

source: You have reached the limits of GameMaker Studio 2 Trial for '{0}'.
zh_cn: 您已达到“{0}”的 GameMaker Studio 2 试用版的限制。

source: You have reached the limits of the Trial license for '{0}'.
zh_cn: 你已经达到 '{0}'试用版许可证的限制?。.

source: You have selected a {0} instead of a {1}.
zh_cn: 您选择了{0}而不是{1}。

source: You have selected to use a new skin but this change requires a restart.\nDo you wish to restart the IDE now?
zh_cn: 你选择使用一个新皮肤，但是这个更改需要重启。\n现在你希望重启IDE吗？

source: You have supplied a name that is not a variable name where one is expected (see here for more info on variables)
zh_cn: 你提供了一个不需要变量名（有关变量的更多信息，请参阅此处 这里）

source: You have supplied the wrong number of arguments when using an accessor (for more information on accessors see here)
zh_cn: 在使用访问器时，你提供了错误数量的参数（有关访问器的更多信息，请参阅这里）

source: You have supplied the wrong type of argument for the expression being evaluated (for more information on expressions see here)
zh_cn: 您为算数表达式提供了错误的参数类型（有关表达式的更多信息，请参阅 这里）

source: You have supplied too many or too few arguments for the given function
zh_cn: 对于给定的函数，你提供了过多或过少的参数

source: You have tried to access a resource that has not been flagged as part of the project for the platform being compiled to
zh_cn: 你尝试访问一个尚未标记为正在编译的平台项目部分的资源

source: You have tried to access an object using an ID value that is incorrect (see here for info on object IDs)
zh_cn: 你尝试使用不正确的 ID 值访问物体（更多有关物体 ID 的信息请查看 这里）

source: You have tried to access, create, or set an array value using a negative array index (for more info on arrays see here)
zh_cn: 您已经尝试使用负数组索引访问、创建或设置数组值（有关数组的更多信息，请参阅 这里）

source: You have tried to assign a new value to the named constant
zh_cn: 您已经尝试为命名的常量分配一个新值

source: You have tried to assign a return value from a script or function when that script or function returns nothing
zh_cn: 当脚本或函数没有返回任何东西时，你尝试从脚本或函数分配返回值

source: You have tried to assign a return value from an expression to a variable when the expression returns nothing (for more information on expressions see here)
zh_cn: 当表达式不返回任何东西时，你尝试将表达式的返回值赋给变量（有关表达式的更多信息，请参阅 这里）

source: You have tried to change the named variable when it cannot be changed (for more information on variables see here)
zh_cn: 你尝试修改无法无法修改的变量（有关变量的更多信息，请参阅 这里）

source: You have tried to compare two different argument types, like a string and a real number (for more information on scripts and arguments see here)
zh_cn: 您尝试比较两种不同的参数类型，比如字符串和实数（有关脚本和参数的更多信息，请参阅 这里）

source: You have tried to convert the given value, for example a string, into a number
zh_cn: 你尝试将给定值转换（例如说将一个字符串转换为一个数字）

source: You have tried to create an array that has more that 2 dimensions (GameMaker Studio 2 only has 1D and 2D arrays - for more info on arrays see here)
zh_cn: 你尝试创建一个具有高于二维空间的数组（GameMaker Studio 2 只有一维和二维数组——有关数组的更多信息请参阅 这里）

source: You have tried to declare a local variable using the same name as one of the built in variables (for more information on variables see here)
zh_cn: 你尝试使用与内置变量相同的名称声明一个局部变量（有关变量的更多信息，请参阅 这里）

source: You have tried to define an enmum using the same name as another previously defined (see here for more information on Enums)
zh_cn: 你尝试使用与前面定义的枚举相同的名称来定义枚举（有关枚举的更多信息，请参阅 这里）

source: You have tried to divide a value by 0
zh_cn: 除数不能为0

source: You have tried to negate a string, for example "string = -string" (for more info on strings see here)
zh_cn: 你尝试为字符串取反，例如 “string = -string”（更多相关信息请参阅 这里）

source: You have tried to reference a variable in the wrong way (for more information on variables see here)
zh_cn: 你尝试以错误的方式引用变量（有关变量的更多信息，请参阅 这里）

source: You have tried to reference an enum entry using a key that has not previously been defined for that enum (see here for more information on Enums)
zh_cn: 你尝试使用没有为枚举定义的键引用枚举条目（有关枚举的更多信息，请参阅 这里）

source: You have tried to set a constant to a different value
zh_cn: 你尝试将常数设置为不同的值

source: You have tried to set a variable that is read only (for more information on variables see here)
zh_cn: 你尝试设置一个只读变量（有关变量的更多信息，请参阅 这里）

source: You have tried to use "!" (not) on a string (for more info on strings see here)
zh_cn: 你尝试在字符串上使用 “!”（非）操作符（更多相关信息请参阅 这里）

source: You have tried to use ++[var] or --[var] in an illegal way (for more information on ++/-- see here)
zh_cn: 你尝试以一种非法的方式使用 ++[var] 或 --[var]（有关 ++ / -- 的更多信息，请参阅 这里）

source: You have tried to use [var]++ or [var]-- in an illegal way (for more information on ++/-- see here)
zh_cn: 你尝试以一种非法的方式使用 [var]++ 或 [var]--（有关 ++ / -- 的更多信息，请参阅 这里）

source: You have tried to use a constant somewhere that is not valid for the code being run
zh_cn: 你尝试在某些地方使用对正在运行的代码无效的常量

source: You have tried to use a symbol as a post-operator when that symbol is not permitted, for example [var]** or [var]>> - only ++ and -- are acceptable (for more information on ++/-- see here)
zh_cn: 你尝试使用不允许的符号作为后操作符，例如 [var]** 或 [var]>> —— 只接受 ++ 和 --（有关 ++ / -- 的更多信息，请参阅 这里

source: You have tried to use a symbol as a pre-operator when that symbol is not permitted, for example **[var] or >>[var] - only ++ and -- are acceptable (for more information on ++/-- see here)
zh_cn: 你尝试使用不允许的符号作为前操作符，例如 **[var] 或 >>[var] —— 只接受 ++ 和 --（有关 ++ / -- 的更多信息，请参阅 这里）

source: You have tried to use a value that does not evaluate to a constant within one of your switch cases (for more information on switch see here)
zh_cn: 你尝试在你的 switch case 中使用一个计算结果不为常数的值（有关 switch 的更多信息，请参阅here）

source: You have tried to use a variable that has been flagged as read only (for more information on variables see here)
zh_cn: 您已经尝试使用标记为只读的变量（有关变量的更多信息，请参阅 这里）

source: You have tried to use an unknown symbol as a binary operator (see here for accepted symbols)
zh_cn: 你尝试使用未知符号作为二元运算符（可用符号请参阅 这里）

source: You have tried to use an unknown symbol as a unary operator (see here for accepted symbols)
zh_cn: 你尝试使用未知符号作为一元运算符（可用符号请参阅 这里）

source: You have tried to use an unknown symbol as an operator (the symbol will be shown in the error, and for a list of accepted symbols see here)
zh_cn: 你尝试使用未知符号作为操作符（该符号将显示在错误中，可用符号的列表请参阅 这里）

source: You have tried to use either a function name or a script name as a variable, for example string = "Hello World"
zh_cn: 您已经尝试使用函数名或脚本名作为变量，例如string = "Hello World"

source: You have tried to use the named variable before it has been initialised (for more information on variables see here)
zh_cn: 你尝试在初始化命名变量之前使用它（有关变量的更多信息，请参阅 这里）

source: You have unsaved changes and will be prompted to save.
zh_cn: 您有未保存的更改，系统将提示您保存。

source: You have use the same name as a resource from the resource tree as a local variable (for more information on variables see here)
zh_cn: 您使用了与资源树中的资源相同的名称作为本地变量（有关变量的更多信息，请参阅 这里）

source: You have used continue within a apart of your code where it is not permitted (see here for more information on continue)
zh_cn: 在不允许使用 continue 的代码中使用了 continue（有关 continue 的更多信息，请参阅 这里）

source: You have used a pragma string that is unknown to the compiler (for more information on gml_pragma see here)
zh_cn: 你使用了编译器不知道的 pragma 字符串（有关 gml_pragma 的更多信息请参阅 这里）

source: You have used a value that is not either a layer ID or a layer name - as a string - in one of the Layer Functions
zh_cn: 你在其中一个 层函数 中使用的值既不是层 ID，也不是层名称（字符串）

source: You have used an erroneous conditional (ternary) operator or if statement, and not the format [condition] ?
zh_cn: 您使用了错误的条件（三元）运算符或 if 语句，而不是 [条件] ?

source: You have used recursive macros that refer to each other and constantly expand
zh_cn: 您使用了相互引用并不断扩展的递归宏

source: You have used something other than a function name in your code where a function should go (see here for more info on using functions)
zh_cn: 你在代码中应该使用函数的地方使用了函数名以外的东西（有关使用函数的更多信息，请参阅 这里）

source: You have used the keyword other outside of the Collision Event or outside of a with statement
zh_cn: 您已经在碰撞事件或 with 语句之外使用了关键字 other

source: You have used the point (".") notation erroneously and not added an expression afterwords correctly (for more information on expressions see here)
zh_cn: 你错误地使用了点（“.”）符号，并且没有正确地添加表达式后文（有关表达式的更多信息，请参阅 这里）

source: You have used the same case constant in two different places within a switch (note that the "original here" comment will be on another line and can be clicked to show the original case:, and you can find more information on switch here)
zh_cn: 你在 switch 语句的两个不同位置使用了相同的 case 常量（请注意，“original here” 注释将位于另一行上，可以单击它来显示原始（异常的来源）的 case:，你可以在 这里 找到关于 switch 的更多信息）

source: You have written an if statement and expression to evaluate, but not given any then part to run (for more information on if see here)
zh_cn: 您已经编写了一个 if 语句和表达式来求值，但没有给出要运行的 then 部分（有关 if 的更多信息，请参阅 这里）

source: You may also use (and get returned) the following built in constants when using pointers:
zh_cn: 在使用指针的时候，你可能会使用（或通过返回得到）如下的内置常量：

source: You must first enable the option and then set either the Raw DPi Override value (the default value is 96) or set the Percentage of the native DPi, and once changed you will be prompted to restart the IDE, which may require you to save any work being done on the currently open project.
zh_cn: 你必须首先启用此选项，然后设置 原始DPI 值（默认为96）或设置 本地DPI百分比，一旦更改，将提示你重启IDE，则可能需要你保存当前打开的项目。

source: You must first enable the option and then set the value (the default value is 96), and once changed you will be prompted to restart the IDE, which may require you to save any work being done on the currently open project.
zh_cn: 你必须先启用该选项然后去设置它的值（默认值为96），并且一旦你应用了修改，你就会被提示去重启IDE，而这就可能要求你保存当前打开的工程的所有工作。

source: You must first open a project to import resources into
zh_cn: 您必须先打开一个项目才能将资源导入

source: You must include at least one resource
zh_cn: 你必须添加至少一个资源

source: You must specifiy the full path to the VCVARS32.BAT file
zh_cn: 你必须指定 VCVARS32.BAT 文件的完整路径

source: You must then send this registration id to your server, and every device that your game is installed on will have a different registration id.
zh_cn: 你必须发送这个注册ID（registration id）到你的服务器，每个设备都拥有独一无二的注册ID（registration id）。

source: You need to commit changes before pulling.
zh_cn: 在拉取之前你需要提交更改。

source: You need to to set the temp path to point to your game *.win file, and then save this as "GM_Test_1.bat" to your desktop (be aware that Notepad will save automatically as a *.txt file unless you choose "all files" from the save dialogue options).
zh_cn: 你需要设置临时路径（<LOCAL TEMP PATH>）指向你的游戏 *.win 文件，然后保存为 “GM_Test_1.bat”（注意记事本会自动保存为 *.txt ，所以你需要在保存对话框的保存类型选择“所有文件”）。

source: You see, an array is basically a container with a number of spaces to store values, and each position in the container has a specific number to identify it, which is what we put in the [].
zh_cn: 你看，一个数组基本上是一个容器，里面有一些存储值的空格，容器中的每个位置都有一个特定的数字编号来标识它，也就是我们放在[]中的内容。

source: You should ALWAYS check that a surface exists using surface_exists before referencing them directly.
zh_cn: 在直接引用它们之前，你需要 一直使用 surface_exists检测表面层是否退出。

source: You should also note that you can name events, or at least give them a short descriptive text that will be shown beside them in the Event Editor.
zh_cn: 您还应该注意，您可以名称事件，或至少给他们一个简短的描述性文本，将在事件编辑器旁边显示。

source: You should also realise that nothing will be seen if the surface itself is not drawn on the screen in the draw event of an instance.
zh_cn: 还需要知道的是，还需要在实例的绘制事件中绘制才可以看到表面层的内容。

source: You should also realise that parents can have parents too!
zh_cn: 你也应该意识到，父母也可以有父母！

source: You should first change the Default settings to create a base for all the resource tree nodes, and then go on to edit individual node label settings as required (note that they will all have "Use Default" selected to start with).
zh_cn: 你应该首先更改 默认 设置以创建所有资源树节点，然后继续根据需要编辑单个节点标签设置（请注意，它们的初始选择都是“使用默认值”）。

source: You should now go to where you created the shortcut to the game executable, and then right click on it and select Properties.
zh_cn: 你现在应该找到游戏快捷方式，并且右键点击并选择属性。

source: You should now have an idea of what the basic resources that are available to you to make your games are, so we'll move on and have a look at the general workflow when using GameMaker Studio 2 and starting out on a new project.
zh_cn: 您现在应该了解了可用于制作游戏的基本资源，因此我们可以继续阅读并了解使用 GameMaker Studio 2 创建新项目的一般工作流程。

source: You should permit the web server to communicate through the firewall if this happens.
zh_cn: 如果发生这种情况，你应该允许网络服务器穿过防火墙进行通信。

source: You simply set the date and time for the notification and it will be displayed to the user if the game is not currently running.
zh_cn: 你仅仅需要设置时间日期和通知内容，如果你的程序当前没有在运行的话，通知就会被推送。You simply set the date and time for the notification and it will be displayed to the user if the game is not currently running.

source: You supply the array to check and the output from the function tells you how many initial entries it contains.
zh_cn: 你需要提供待检测的数组，然后函数的输出将会告诉你它包含多少初始元素。

source: You supply the entry number for the first dimension and the function will return the number of second dimension entries that the array has (to find the length of the first dimension use the function array_height_2D).
zh_cn: 你需要提供数组第一个维度的元素索引，然后函数会返回你在该元素下数组的长度（如果要获得数组的第一个维度请使用函数array_height_2d）。

source: You supply the name of the global variable to get the value of as a string (see example code below) and the function will return the value held by the global variable.
zh_cn: 你需要提供待取得值的全局变量的字符串形式的名称（见下方代码），然后这个函数就会返回该全局变量所承载的值。

source: You tell the function the length of the array to create, and it will return the "handle" for the array which you can then assign to a variable.
zh_cn: 你需要告诉这个函数所要创建的数组长度，然后它会返回给你这个数组的“句柄”，你可以将这个句柄赋给一个变量。

source: You then drag the object into a room in the Room Editor to create an instance copied from the basic object template.
zh_cn: 然后，将物体拖动到房间编辑器</ a1>中的房间，以创建从基本物体模板复制的实例。

source: You use a MASK.
zh_cn: 你可以使用掩码。

source: You will also need the path to the <yourgame>.win file, as this is what we are going to point the runner to.
zh_cn: 你还需要找到 <你的游戏>.win 文件，因为这是我们需要指向 Runner 的文件。

source: You will be prompted to give a save location and a name for the file, and you should take note of this for future reference.
zh_cn: 系统会提示你要保存的位置和文件的名称，你应该注意这个以备将来参考。

source: You will need to log in again with the same licence (or any other) to be able to use the product later.
zh_cn: 注销后您将需要使用同一个（或者其他有效的）帐户 再次登录 才能继续使用本产品。

source: You will need to close and re-open the Preferences window for the new feed to be shown.
zh_cn: 你将需要关闭并重新打开偏好设置窗口，以显示新的下载源。

source: You will need to set up a signing certificate before you can create and publish packages.
zh_cn: 在创建和发布程序包之前，你将需要设置一个签名证书。

source: You will notice that the array has been initialised backwards, with the last value being defined first.
zh_cn: 你将会注意这个数组是倒序初始化的，最后一个位置是首先定义的。
